       01  histRec.
         02  histKey.
           03  histGen         PIC 9(5).
           03  histSub         PIC 9(12).
           03  histDate        PIC 9(8).
           03  histRef         PIC 9(9).
           03  histJr          PIC 9(3).
         02  histInv           PIC 9(12).
         02  histAmt           PIC S9(12)V99.
         02  histDesc          PIC X(20).
         02  histExtra         PIC X(5).
         02  histIntroUser     PIC 9(3).
         02  histIntroDate     PIC 9(8).